const chemistry = {
  name: 'Химия',
  children: [
    {
      name: 'Неорганическая',
      children: [
        { name: 'Предмет химии' },
        { name: 'Химические элементы' },
        { name: 'Химические реакции' },
        { name: 'Атомы и молекулы' },
        { name: 'Классы неорганических соединений' },
      ],
    },

    {
      name: 'Органическая',
      children: [{ name: 'Общая характеристика органических соединений' }, { name: 'Классы органических соединений' }],
    },

    {
      name: 'Общая',
      children: [
        { name: 'Аналитика' },
        { name: 'Физколлоиды' },
        { name: 'Термодинамика' },
        { name: 'Кинетика реакций' },
      ],
    },
  ],
};

export default chemistry;
