const geometry = {
  name: 'Геометрия',
  children: [
    {
      name: 'Планиметрия',
      children: [
        { name: 'Аксиомы планиметрии' },
        { name: 'Простейшие геометрические фигуры и их свойства' },
        { name: 'Смежные и вертикальные углы' },
        { name: 'Взаимное расположение прямых на плоскости' },
        { name: 'Треугольники' },
        { name: 'Признаки равенства треугольников' },
        { name: 'Геометрические построения' },
        { name: 'Подобие треугольников' },
        { name: 'Площади фигур' },
        { name: 'Многоугольники' },
        { name: 'Четырехугольники' },
        { name: 'Теорема Пифагора' },
        { name: 'Окружность' },
        { name: 'Элементы тригонометрии' },
        { name: 'Векторы' },
        { name: 'Декартовы координаты на плоскости' },
        { name: 'Геометрические преобразования' },
      ],
    },

    {
      name: 'Стереометрия',
      children: [
        { name: 'Аксиомы стереометрии' },
        { name: 'Параллельность прямых и плоскостей' },
        { name: 'Перпендикулярность прямых и плоскостей' },
        { name: 'Векторы в пространстве' },
        { name: 'Декартовы координаты в пространстве' },
        { name: 'Многогранники' },
        { name: 'Тела вращения' },
        { name: 'Объемы тел' },
        { name: 'Изображение пространственных фигур' },
      ],
    },

    {
      name: 'История математики',
      children: [{ name: 'Геометрия в историческом развитии' }],
    },
  ],
};

export default geometry;
