const russian = {
  name: 'Русский язык',
  children: [
    {
      name: 'Общие сведения о языке',
      children: [
        { name: 'Основные разделы науки о языке' },
        { name: 'Понятие о литературном языке' },
        { name: 'История возникновения русского языка' },
        { name: 'Русский язык в современном мире' },
        { name: 'Стилистика текста' },
      ],
    },

    {
      name: 'Фонетика, графика',
      children: [
        { name: 'Общие сведения' },
        { name: 'Звуки(гласные и согласные, звонкие и глухие, твёрдые и мягкие)' },
        { name: 'Слоги и перенос слов' },
        { name: 'Ударение' },
        { name: 'Графика' },
      ],
    },

    {
      name: 'Морфемика и словообразование',
      children: [
        { name: 'Состав слова' },
        { name: 'Основа слова' },
        { name: 'Окончание' },
        { name: 'Корень' },
        { name: 'Приставка' },
        { name: 'Суффикс' },
        { name: 'Способы словообразования' },
        { name: 'Исторические изменения в составе слова' },
      ],
    },

    {
      name: 'Лексикология',
      children: [
        { name: 'Лексическое значение слова' },
        { name: 'Однозначные и многозначные слова' },
        { name: 'Прямое и переносное значение' },
        { name: 'Омонимы, синонимы, антонимы, паронимы' },
        { name: 'Понятие об этимологии' },
        { name: 'Историзмы, архаизмы, неологизмы' },
        { name: 'Заимствованные слова' },
        { name: 'Старославянизмы' },
      ],
    },

    {
      name: 'Фразеология',
      children: [{ name: 'Фразеологизмы' }, { name: 'Пословицы и поговорки' }, { name: 'Крылатые слова и выражения' }],
    },
  ],
};

export default russian;
